CART_TOTAL_PRICE_GET_DESC = '''
Сумма товаров в корзине. 
Доступно только аутентифицированным пользователям.
'''

CART_PRODUCT_DELETE_DESC = '''
Удалить товар из корзины.
Доступно только аутентифицированным пользователям.
'''

CART_PRODUCT_GET_DESC = '''
Получить товары из корзины по ID.
Доступно только аутентифицированным пользователям.
'''

ADD_PRODUCT_TO_CART_POST_DESC = '''
Добавить товар в корзину.
Доступно только аутентифицированным пользователям.
'''

UPDATE_CART_PRODUCT_PUT_DESC = '''
Изменить товар в корзине.
Доступно только аутентифицированным пользователям.
'''

FAVORITE_PRODUCT_GET_DESC = '''
Получить избранные товары.
Доступно только аутентифицированным пользователям.
'''

FAVORITE_PRODUCT_POST_DESC = '''
Добавить товар в избранное.
Доступно только аутентифицированным пользователям.
'''

FAVORITE_PRODUCT_DELETE_DESC = '''
Удалить товар из избранного.
Доступно только аутентифицированным пользователям.
'''